Autodesk.Navisworks.Api.PickPrimitives
Different types of primitive used to define geometry

Autodesk.Navisworks.Api.PickPrimitives.None
Nothing extra to return or do

Autodesk.Navisworks.Api.PickPrimitives.Edge0To1
Snap to tri edge between vertex 0 and 1

Autodesk.Navisworks.Api.PickPrimitives.Edge1To2
Snap to tri edge between vertex 1 and 2

Autodesk.Navisworks.Api.PickPrimitives.Edge2To0
Snap to tri edge between vertex 2 and 0

Autodesk.Navisworks.Api.PickPrimitives.Edge
Snap to any tri edge

Autodesk.Navisworks.Api.PickPrimitives.Vertex0
Snap to tri vertex 0

Autodesk.Navisworks.Api.PickPrimitives.Vertex1
Snap to tri vertex 1

Autodesk.Navisworks.Api.PickPrimitives.Vertex2
Snap to tri vertex 2

Autodesk.Navisworks.Api.PickPrimitives.Vertex
Snap to any vertex

Autodesk.Navisworks.Api.PickPrimitives.LineVertex0
Snap to line vertex 0

Autodesk.Navisworks.Api.PickPrimitives.LineVertex1
Snap to line vertex 1

Autodesk.Navisworks.Api.PickPrimitives.LineVertex
Snap to any line vertex

Autodesk.Navisworks.Api.PickPrimitives.LineMiddle
Snap to middle of the line

Autodesk.Navisworks.Api.PickPrimitives.ArcCenter
Snap to the center of circular and elliptical arcs

Autodesk.Navisworks.Api.PickPrimitives.Point
Point at pick

Autodesk.Navisworks.Api.PickPrimitives.Distance
Distance at pick

Autodesk.Navisworks.Api.PickPrimitives.NearThreshold
Nearer than near_threshold

Autodesk.Navisworks.Api.PickPrimitives.Center
Nearest to center, rather than to camera

Autodesk.Navisworks.Api.PickPrimitives.CenterExactSurface
Ignore surface not under center